import { RecipeCardType } from "./definitions";

export const recipeExamples: RecipeCardType[] = [
    {
        id: '7A8D4757-0249-4372-8FA2-B245C6438446',
        title: 'Овсяное печенье с изюмом и кунжутом',
        description: 'Печенье для тех, кто не любит возиться с тестом, и ждать его из духовки нужно ровно 15 минут. Орехи можно взять любые — например, кроме грецких добавить миндаль, тыквенные или подсолнечные семечки. И не игнорируйте лимонную цедру, с ней печенье так соблазнительно пахнет! Такого вы точно в магазине не купите. Подробный видеорецепт прилагается.',
        cook_time: '25',
        servings: 12,
        calories: '193',
        image_url: '/recipe-examples/1.jpeg',
        recipe_url: '',
    },
    {
        id: '18795A94-34A9-481C-ABBE-B1CC021E0820',
        title: 'Борщ со свежими помидорами',
        description: 'Положите мелко нарезанные свежие помидоры к традиционной зажарке из лука и моркови. Они пропитают и смягчат овощи своим соком, усилят характерную пикантность капусты и придадут борщу по-летнему освежающие нотки. Возьмите для бульона курицу, она добавит все необходимые питательные вещества и раскроет вкус овощей, не перебивая их. Свеклу достаточно натереть и обжарить, положив в борщ в самом конце. Она дойдет до готовности, пока блюдо настаивается, а бульон сохранит ее яркий цвет.',
        cook_time: '85',
        servings: 6,
        calories: '52',
        image_url: '/recipe-examples/2.jpeg',
        recipe_url: '',
    },
    {
        id: '37CA8D6E-FBBF-453F-9B2C-3F9E0CE1210E',
        title: 'Шаурма по-домашнему',
        description: 'Залог вкусной шаурмы — это соус, ведь именно от него зависит сочность блюда. Я добавляю в соус греческий йогурт и много овощей, чтобы сделать шаурму менее калорийной и более здоровой и питательной.',
        cook_time: '90',
        servings: 2,
        calories: '154',
        image_url: '/recipe-examples/3.jpeg',
        recipe_url: '',
    },
];